
local map = require 'maps.map'

map.units = {}

--小兵类型
map.units['小兵类型'] = {}
	map.units['小兵类型']['沉沦遗迹'] = {}
		map.units['小兵类型']['沉沦遗迹']['上路'] = {'萌物A', '萌物A', '萌物A', '少女A', '少女A'}
		map.units['小兵类型']['沉沦遗迹']['中路'] = {'萌物A', '萌物A', '萌物A', '少女A', '少女A'}
		map.units['小兵类型']['沉沦遗迹']['下路'] = {'萌物A', '萌物A', '萌物A', '少女A', '少女A'}
	map.units['小兵类型']['幻想神社'] = {}
		map.units['小兵类型']['幻想神社']['上路'] = {'萌物B', '萌物B', '萌物B', '少女B', '少女B'}
		map.units['小兵类型']['幻想神社']['中路'] = {'萌物B', '萌物B', '萌物B', '少女B', '少女B'}
		map.units['小兵类型']['幻想神社']['下路'] = {'萌物B', '萌物B', '萌物B', '少女B', '少女B'}

